//----------------------------------------------------------------------------

//Модуль управления аудиотрактом, заголовочный файл

//----------------------------------------------------------------------------

#ifndef AUDIO_HPP
#define AUDIO_HPP

//----------------------------- Константы: -----------------------------------

enum AudioState_t
{
  AUD_MUTE = 1 << 0,
  AUD_REV  = 1 << 1,
  AUD_REC  = 1 << 2
};

//----------------------------------------------------------------------------
//---------------------------- Класс TAudio: ---------------------------------
//----------------------------------------------------------------------------

class TAudio
{
private:
  Pin_Rec_t Pin_Rec;        //включение записи
  Pin_PlayR_t Pin_PlayR;    //включение реверсного канала УВ
  Pin_PlayF_t Pin_PlayF;    //включение прямого канала УВ (не используется)
  Pin_Mute_t Pin_Mute;      //блокировка УВ
#ifdef REV_C
  Pin_Fast_t Pin_Fast;      //скорость FAST
  Pin_Slow_t Pin_Slow;      //скорость SLOW
#endif
  bool fMasterMute;         //глобальный Mute
  bool fNormalMute;         //обычный Mute
public:
  TAudio(void);
  void MasterMute(bool on); //глобальное включение/выключение MUTE
  void MuteToggle(void);    //переключение глобального MUTE
  void Mute(bool on);       //включение/выключение MUTE
  void Rev(bool on);        //включение/выключение реверсного канала
  void Rec(bool on);        //включение/выключение записи
  uint8_t GetState(void);   //чтение состояния
};

//----------------------------------------------------------------------------

#endif
