//----------------------------------------------------------------------------

//Модуль поддержки EEPROM

//----------------------- Используемые ресурсы: ------------------------------

//Используется встроенная EEPROM.

//----------------------------------------------------------------------------

#include "main.hpp"
#include "eeprom.hpp"
#include <avr/eeprom.h>
#include <avr/wdt.h>

//----------------------------------------------------------------------------
//----------------------------- Класс TEeprom: -------------------------------
//----------------------------------------------------------------------------

//---------------------------- Конструктор: ----------------------------------

TEeprom::TEeprom(void)
{
  fValid = 1;
  fValid = (Rd16(EE_SIGN) == EE_SIGNATURE);
}

//----------------------------------------------------------------------------
//------------------------- Интерфейсные методы: -----------------------------
//----------------------------------------------------------------------------

//--------------------- Чтение 8-разрядного значения: ------------------------

uint8_t TEeprom::Rd8(uint8_t addr, uint8_t def)
{
  if(fValid)
    return(eeprom_read_byte((uint8_t*)addr));
  return(def);
}

//--------------------- Запись 8-разрядного значения: ------------------------

void TEeprom::Wr8(uint8_t addr, uint8_t val)
{
  if(eeprom_read_byte((uint8_t*)addr) != val)
  {
    eeprom_write_byte((uint8_t*)addr,val);
    wdt_reset();
  }
}

//--------------------- Чтение 16-разрядного значения: -----------------------

uint16_t TEeprom::Rd16(uint8_t addr, uint16_t def)
{
  uint16_t val;
  uint8_t *bytes = (uint8_t*)(&val);
  bytes[0] = Rd8(addr++, LO(def));
  bytes[1] = Rd8(addr,   HI(def));
  return(val);
}

//--------------------- Запись 16-разрядного значения: -----------------------

void TEeprom::Wr16(uint8_t addr, uint16_t val)
{
  uint8_t *bytes = (uint8_t*)(&val);
  Wr8(addr++, bytes[0]);
  Wr8(addr,   bytes[1]);
}

//-------------------------- Запись сигнатуры: -------------------------------

void TEeprom::Validate(void)
{
  Wr16(EE_SIGN, EE_SIGNATURE);
  fValid = (Rd16(EE_SIGN) == EE_SIGNATURE);
}

//----------------------- Сброс флага валидности: ----------------------------

void TEeprom::Invalidate(void)
{
  fValid = 0;
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
