//----------------------------------------------------------------------------

//Модуль обслуживания датчика движения ленты, заголовочный файл

//----------------------------------------------------------------------------

#ifndef MOVESENSOR_HPP
#define MOVESENSOR_HPP

//----------------------------- Константы: -----------------------------------

enum MoveSpeed_t
{
  MOVE_FAST = 0,
  MOVE_SLOW = 1
};

//----------------------------------------------------------------------------
//-------------------------- Класс TMoveSensor: ------------------------------
//----------------------------------------------------------------------------

class TMoveSensor
{
private:
  Pin_Move_t Pin_Move; //вход датчика движения ленты
  Pin_Tmc_t Pin_Tmc;   //выход переключения пост. времени
public:
  TMoveSensor(void);
  void Execute(void);
  void SetTC(bool tc); //установка постоянной времени
  bool GetTC(void);    //чтение постоянной времени
  bool Move(void);     //чтение наличия движения ленты
};

//----------------------------------------------------------------------------

#endif
