//----------------------------------------------------------------------------

//Модуль поддержки порта, заголовочный файл

//----------------------------------------------------------------------------

#ifndef PORT_HPP
#define PORT_HPP

//----------------------------------------------------------------------------

#include "wakeport.hpp"
#include <avr/pgmspace.h>

//----------------------------- Константы: -----------------------------------

uint8_t const DevName[] PROGMEM = { "E-004 V"VERSION }; //имя устройства

//----------------------------------------------------------------------------
//------------------------------ Класс TPort ---------------------------------
//----------------------------------------------------------------------------

class TPort
{
private:
  static uint16_t const BAUD_RATE = 19200; //скорость обмена, бод
  static uint16_t const br = (F_CPU / BAUD_RATE / 8 + 1) / 2;
public:
  TWakePort WakePort = TWakePort(br);
  TPort(void);
  void Execute(void);
};

//----------------------------------------------------------------------------

#endif
