//----------------------------------------------------------------------------

//Модуль поддержки порта, заголовочный файл

//----------------------------------------------------------------------------

#ifndef PORT_HPP
#define PORT_HPP

//----------------------------------------------------------------------------

#include "wakeport.hpp"

//----------------------------- Константы: -----------------------------------

__flash uint8_t const DevName[] = { "E-004 V"VERSION }; //имя устройства

//----------------------------------------------------------------------------
//------------------------------ Класс TPort ---------------------------------
//----------------------------------------------------------------------------

class TPort
{
private:
  static uint16_t const BAUD_RATE = 19200; //скорость обмена, бод
  static uint8_t const FRAME_SIZE = 24;    //максимальный размер фрейма, байт
public:
  TWakePort *WakePort;
  TPort(void);
  void Execute(void);
};

//----------------------------------------------------------------------------

#endif
