//----------------------------------------------------------------------------

//Модуль поддержки порта, заголовочный файл

//----------------------------------------------------------------------------

#ifndef PORT_HPP
#define PORT_HPP

//----------------------------------------------------------------------------

#include "wakeport.hpp"
#include <avr/pgmspace.h>

//----------------------------- Константы: -----------------------------------

#ifndef EXTRA_VER
#define EXTRA_VER ""
#endif

uint8_t const DevName[] PROGMEM = { "E-004 V" VERSION " " EXTRA_VER }; //имя устройства

//----------------------------------------------------------------------------
//------------------------------ Класс TPort ---------------------------------
//----------------------------------------------------------------------------

class TPort
{
private:

public:
  TPort();
  void Start(void);
  void Execute(void);
  TWakePort WakePort;
};

//----------------------------------------------------------------------------

#endif
